export const TypeResident = [
    { value: "1", text: "มีผู้อยู่อาศัย" },
    { value: "2", text: "บ้านว่าง" },
    { value: "3", text: "บ้านร้าง" },
    { value: "4", text: "หาไม่พบ" }
]

export const YesNo= [
    { value: "1", text: "มี" },
    { value: "0", text: "ไม่มี" }
]

export const TypeMember= [
    { value: "1", text: "มี (ผู้ถือครองทำการเกษตร)" },
    { value: "0", text: "ไม่มี (ครัวเรือนผู้รับจ้างทำการเกษตร)" }
]

export const Gender= [
    { value: "1", text: "ชาย" },
    { value: "2", text: "หญิง" }
]

export const Inside= [
    { value: "1", text: "มีเฉพาะในจังหวัดนี้" },
    { value: "2", text: "มีทั้งในจังหวัดนี้และจังหวัดอื่น" },
    { value: "3", text: "มีเฉพาะจังหวัดอื่น" }
]


export const DoNot= [
    { value: "1", text: "ได้" },
    { value: "0", text: "ไม่ได้" }
]

export const IsNot= [
    { value: "1", text: "เป็น" },
    { value: "0", text: "ไม่เป็น" }
]

export const Prefix= [
    { value: "1", text: "นาย" },
    { value: "2", text: "นาง" },
    { value: "3", text: "นางสาว" },
    { value: "4", text: "อื่นๆ" }
]

export const R26 = [
    { value: "1", text: "แจงนับต่อไป" },
    { value: "2", text: "ไม่ต้องแจงนับ" }
]

export const R29_LIST= [
    { value: "1", text: "แจงนับต่อไป" },
    { value: "2", text: "ไม่ต้องแจงนับ" },
    { value: "3", text: "แจงนับแทน" },
    { value: "4", text: "ส่งต่อให้แจงนับ" }
]

export const R32_LIST= [
    { value: "1", text: "เป็นสมาชิกในบ้านนี้" },
    { value: "2", text: "เป็นแต่เสียชีวิตแล้ว" },
    { value: "3", text: "ไม่เป็น" },
    { value: "4", text: "เป็นผู้ถือครองทำการเกษตร" }
]

export const R33_LIST= [
    { value: "1", text: "ไม่เคย" },
    { value: "2", text: "เคยทำการเกษตรของตนเอง" },
    { value: "3", text: "เคยรับจ้างทำการเกษตร" }
]

export const R36_LIST= [
    { value: "1", text: "ทราบ" },
    { value: "2", text: "ไม่ทราบ" },
    { value: "3", text: "ไม่รู้จัก" },
    { value: "4", text: "เสียชีวิตแล้ว" }
]

export const R37_LIST= [
    { value: "1", text: "อยู่ (นับจดเพิ่มตามที่อยู่ใหม่)" },
    { value: "0", text: "ไม่อยู่" }
]

export const R39_LIST= [
    { value: "1", text: "เป็นผู้ถือครอง" },
    { value: "2", text: "เป็นผู้ช่วยทำการเกษตร" },
    { value: "3", text: "เป็นสมาชิกครัวเรือนผู้ถือครองไม่ทำการเกษตร" },
    { value: "4", text: "ไม่เคยทำการเกษตร" },
    { value: "5", text: "เคยทำการเกษตร" },
    { value: "6", text: "เคยรับจ้างทำการเกษตร" },
    { value: "7", text: "เป็นผู้จ้างทำการเกษตร" },
    { value: "8", text: "เป็นสมาชิกครัวเรือนผู้รับจ้าง ไม่ทำการเกษตร" },
    { value: "text", text: "พบอยู่นอกเขตปฏิบัติงานนี้" },
    { value: "9", text: "(ชั่วคราว) เป็นผู้ถือครอง (แจ้งต้นทาง)" },
    { value: "10", text: "(ชั่วคราว) รอข้อมูลจากเขตอื่น" },
    { value: "11", text: "เสียชีวิต" },
    { value: "12", text: "ไม่ทราบร่องรอย" },
]

export const R40_LIST= [
    { value: "1", text: "รายเดิมและขึ้นทะเบียน" },
    { value: "2", text: "รายเดิมแต่ไม่ขึ้นทะเบียน" },
    { value: "3", text: "เป็นผู้ขึ้นทะเบียน" },
    { value: "4", text: "นอกระบบทะเบียน" },
    { value: "text", text: "นอกเขต" },
    { value: "5", text: "รายเดิมและขึ้นทะเบียน" },
    { value: "6", text: "รายเดิมแต่ไม่ขึ้นทะเบียน" },
    { value: "7", text: "เป็นผู้ขึ้นทะเบียน" },
    { value: "8", text: "นอกระบบทะเบียน" },
    { value: "9", text: "รายใหม่" }
]

export const _R28 = [
    { value: "1", text: "ได้" },
    { value: "2", text: "ไม่ได้ แต่สามารถให้ที่อยู่ผู้ดูแลแทนได้" },
    { value: "3", text: "ไม่ได้ และไม่สามารถให้ที่อยู่ผู้ดูแลแทนได้" }
]

export const _R35= [
    { value: "1", text: "ทราบ" },
    { value: "2", text: "ไม่ทราบ" },
    { value: "3", text: "ไม่รู้จัก" },
    { value: "4", text: "เสียชีวิตแล้ว" },
]

export const _R36 = [
    { value: "1", text: "อยู่ (นับจดเพิ่มตามที่อยู่ปัจจุบัน)" },
    { value: "0", text: "ไม่อยู่" }
]



export const _A01= [
    { value: "1", text: "1. ขึ้นทะเบียน" },
    { value: "0", text: "2. ไม่ขึ้นทะเบียน" }
]

export const _A02= [
    { value: "1", text: "1. ทำ" },
    { value: "0", text: "2. ไม่ทำ" }
]

export const _A03= [
    { value: "1", text: "1. เพื่อขายเป็นหลัก" },
    { value: "2", text: "2. เพื่อบริโภคเป็นหลัก" }
    /* { value: "3", text: "3. เพื่อขายและบริโภค" } */
]

export const _A04= [
    { value: "1", text: "1. ครัวเรือนเดียว" },
    { value: "2", text: "2. บุคคล 2 คนขึ้นไปที่อยู่ต่างครัวเรือน หรือครัวเรือนตั้งแต่ 2 ครัวเรือนขึ้นไป" },
    { value: "3", text: "3. บริษัทหรือห้างหุ้นส่วนนิติบุคคล" },
    { value: "4", text: "4. หน่วยงานของรัฐ" },
    { value: "5", text: "5. อื่นๆ" }
]

export const _A05= [
    { value: "1", text: "1. ทำ" },
    { value: "0", text: "2. ไม่ทำ (ข้ามไปถาม ตอนที่ 2)" }
]

export const A06= [
    { value: "1", text: "1. ทำ" },
    { value: "0", text: "2. ไม่ทำ (ข้ามไปถาม ตอนที่ 2)" }
]

/* export const SUS= [
    { value: "1", text: "1. เกษตรผสมผสาน" },
    { value: "2", text: "2. เกษตรอินทรีย์" },
    { value: "3", text: "3. เกษตรธรรมชาติ" },
    { value: "4", text: "4. เกษตรทฤษฏีใหม่" },
    { value: "5", text: "5. วนเกษตร" }
] */

//ตอนที่ 3 ข้าว
export const C01= [
    { value: "1", text: "1. ปลูก" },
    { value: "0", text: "2. ไม่ปลูก (ข้ามไปถาม ตอนที่ 4)" }
]

export const C02= [
    { value: "1", text: "1. เพื่อขาย" },
    { value: "2", text: "2. เพื่อบริโภค" },
    { value: "3", text: "3. เพื่อขายและบริโภค" }
]

//ตอนที่ 4 ยางพารา
export const D01= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ตอนพิเศษ 1)" }
]

//ตอนที่ 5 พืชยืนต้น ไม้ผล สวนป่า
export const E01= [
    { value: "1", text: "1. มี (ถ้า ตอนพิเศษ 1 มีการปลูกพืช รหัส XXXXX อย่างน้อย 1 ชนิด)" },
    { value: "0", text: "2. ไม่มี (ถ้า ตอนพิเศษ 1 ไม่มีการปลูกพืช รหัส XXXXX)" }
]


//ตอนที่ 6 พืชไร่
export const F01= [
    { value: "1", text: "1. มี (ถ้า ตอนพิเศษ 1 มีการปลูกพืช รหัส XXXXX อย่างน้อย 1 ชนิด)" },
    { value: "0", text: "2. ไม่มี (ถ้า ตอนพิเศษ 1 ไม่มีการปลูกพืช รหัส XXXXX)" }
]

//ตอนที่ 7 พืชผัก สมุนไพร และไม้ดอก ไม้ประดับ
export const G01= [
    { value: "1", text: "1. มี (ถ้า ตอนพิเศษ 1 มีการปลูกพืช รหัส XXXXX อย่างน้อย 1 ชนิด)" },
    { value: "0", text: "2. ไม่มี (ถ้า ตอนพิเศษ 1 ไม่มีการปลูกพืช รหัส XXXXX)" }
]

export const G06= [
    { value: "1", text: "1. มี (ถ้า ตอนพิเศษ 1 มีการปลูกพืช รหัส XXXXX อย่างน้อย 1 ชนิด)" },
    { value: "0", text: "2. ไม่มี (ถ้า ตอนพิเศษ 1 ไม่มีการปลูกพืช รหัส XXXXX)" }
]

//ตอนที่ 8 การเลี้ยงสัตว์ (รวมการเลี้ยงไหม)
export const B01= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ข้อ 2)" }
]

export const B04= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ตอนที่ 9)" }
]

//ตอนที่ 9 การเลี้ยงสัตว์น้ำในพื้นที่น้ำจืด
export const H01= [
    { value: "1", text: "1. เลี้ยงสัตว์น้ำในพื้นที่น้ำจืด" },
    { value: "2", text: "2. เพาะฟักและ/ หรืออนุบาลสัตว์น้ำในพื้นที่น้ำจืด" },
    { value: "3", text: "3. ทั้งเลี้ยงสัตว์น้ำในพื้นที่น้ำจืดและเพาะฟักและ/ หรืออนุบาลสัตว์น้ำในพื้นที่น้ำจืด" },
    { value: "4", text: "4. ไม่เลี้ยง (ข้ามไปถาม ตอนที่ 10)" },
]

export const H02= [
    { value: "1", text: "1. เพื่อขาย" },
    { value: "2", text: "2. เพื่อบริโภค" },
    { value: "3", text: "3. เพื่อขายและบริโภค" },
]

//ตอนที่ 10 กำรทำนำเกลือสมุทร
export const S01= [
    { value: "1", text: "1. ทำ" },
    { value: "0", text: "2. ไม่ทำ (ข้ามไปถาม ตอนที่ 11)" },
]

//ตอนที่ 11 เครื่องจักร เครื่องมือ และอุปกรณ์การขนส่งเพื่อการเกษตร
export const J01= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ตอนที่ 12)" },
]

//ตอนที่ 12 การใช้ปุ๋ย การป้องกันกำจัดศัตรูพืช และการจ้างทำงานเกษตรในที่ถือครอง
export const I01= [
    { value: "1", text: "1. ใช้" },
    { value: "0", text: "2. ไม่ใช้ (ข้ามไปถาม ข้อ 3)" },
]

export const I03= [
    { value: "1", text: "1. ใช้" },
    { value: "0", text: "2. ไม่ใช้ (ข้ามไปถาม ข้อ 5)" },
]

export const I05= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี" },
]

export const I06= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี" },
]

//ตอนที่ 14 รายได้ รายจ่าย และหนี้สินทำงการเกษตร
export const L01= [
    { value: "1", text: "1. จากผลผลิตทางการเกษตรในที่ถือครองอย่างเดียว" },
    { value: "2", text: "2. รายได้ส่วนใหญ่จากผลผลิตทางการเกษตรในที่ถือครอง" },
    { value: "3", text: "3. รายได้ส่วนใหญ่จากการรับจ้างทางานเกษตร" },
    { value: "4", text: "4. รายได้ส่วนใหญ่จากแหล่งอื่นนอกเหนือจากผลผลิตการเกษตรและการรับจ้างทางานเกษตร" },
]

export const L13= [
    { value: "1", text: "1. มีหนี้สินเพื่อการเกษตร" },
    { value: "2", text: "2. มีหนี้สินไม่ใช่เพื่อการเกษตร" },
    { value: "3", text: "3. มีหนี้สินทั้งเพื่อการเกษตรและไม่ใช่หนี้สินเพื่อการเกษตร" },
    { value: "4", text: "4. ไม่มี (ยุติการสัมภาษณ์)" },
]


// Version 2
export const _B01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.2)" }
]

export const _B02= [
    { value: "1", text: "1. เพื่อขายอย่างเดียว" },
    { value: "2", text: "2. เพื่อบริโภคอย่างเดียว" },
    { value: "3", text: "3. เพื่อขายเป็นหลัก" },
    { value: "4", text: "4. เพื่อบริโภคเป็นหลัก" }
]

export const _C01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.3)" }
]

export const _D01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.4)" }
]

export const _E01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.5)" }
]

export const _F01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.6)" }
]

export const _G01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.7)" }
]

export const _H01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.8)" }
]

export const _I01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 3.9)" }
]

export const _J01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 4)" }
]

export const _T02= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไป ตอนที่ 5)" }
]

export const _K01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 5)" }
]

export const _T03_1= [
    { value: "1", text: "1. เลี้ยงสัตว์น้ำในพื้นที่น้ำจืด" },
    { value: "2", text: "2. เพาะฟักและ/หรืออนุบาลสัตว์น้ำในพื้นที่น้ำจืด" },
    { value: "3", text: "3. ทั้งเลี้ยงสัตว์น้ำในพื้นที่น้ำจืดและเพาะฟักและ/หรืออนุบาลสัตว์น้ำในพื้นที่น้ำจืด" }
]

export const _T03_2= [
    { value: "1", text: "1. เพื่อขายเป็นหลัก" },
    { value: "2", text: "2. เพื่อบริโภคเป็นหลัก" }
   /*  { value: "3", text: "3. เพื่อขายและบริโภค" } */
]

export const _L01= [
    { value: "1", text: "1. มี" },
    { value: "2", text: "2. ไม่มี (ข้ามไป ตอนที่ 6)" }
]

export const _T04= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไป ตอนที่ 7)" }
]

export const _N01= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ข้อที่ 2)" }
]

export const _N26= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ข้อที่ 3)" }
]

export const _N31= [
    { value: "1", text: "1. มี (บันทึก ข้อที่ 3.2)" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ตอนที่ 8)" }
]

export const _O01= [
    { value: "1", text: "1. ใช้" },
    { value: "0", text: "2. ไม่ใช้ (ข้ามไปถาม ข้อ 3)" }
]

export const _O03= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ข้อ 5)" }
]

export const _O05= [
    { value: "1", text: "1. กังวล" },
    { value: "0", text: "2. ไม่กังวล" }
]

export const _O06= [
    { value: "1", text: "1. มี" },
    { value: "0", text: "2. ไม่มี (ข้ามไปถาม ตอนที่ 9)" }
]

export const _P01= [
    { value: "1", text: "1. จากผลผลิตทางการเกษตรในที่ถือครองอย่างเดียว" },
    { value: "2", text: "2. รายได้ส่วนใหญ่จากผลผลิตทางการเกษตรในที่ถือครอง" },
    { value: "3", text: "3. รายได้ส่วนใหญ่จากการรับจ้างทำงานเกษตร" },
    { value: "4", text: "4. รายได้ส่วนใหญ่จากแหล่งอื่นนอกเหนือจากผลผลิตทางการเกษตรและการรับจ้างทำงานเกษตร" }
]

export const _P10= [
    { value: "1", text: "1. มีหนี้สินทางการเกษตร" },
    { value: "2", text: "2. มีหนี้สินอื่นๆ ที่ไม่ใช่ทางการเกษตร" },
    { value: "3", text: "3. มีหนี้สินทางการเกษตรและอื่นๆ ที่ไม่ใช่ทางการเกษตร" },
    { value: "4", text: "4. ไม่มีหนี้สิน (ข้ามไปถาม ตอนที่ 10)" }
]

export const _Q03= [
    { value: "1", text: "หัวหน้าครัวเรือน" },
    { value: "2", text: "ภรรยา/สามี" },
    { value: "3", text: "บุตร (รวมบุตรเลี้ยง และบุตรบุญธรรม)" },
    { value: "4", text: "บุตรเขย บุตรสะใภ้" },
    { value: "5", text: "บุตรของบุตร" },
    { value: "6", text: "บิดา มารดา (รวม พ่อตา แม่ยาย ปู่ ย่า ตา ยายและญาติอื่น ๆ)" },
    { value: "7", text: "ผู้อาศัย คนรับใช้ ลูกจ้างทำงานเกษตร" }
]

export const _Q06= [
    { value: "1", text: "ชาย" },
    { value: "2", text: "หญิง" }
]

export const _Q07= [
    { value: "1", text: "โสด" },
    { value: "2", text: "สมรส จดทะเบียน" },
    { value: "3", text: "สมรส ไม่จดทะเบียน หรืออยู่กินฉันสามี ภรรยา" },
    { value: "4", text: "หม้าย" },
    { value: "5", text: "หย่า" },
    { value: "6", text: "แยกทางกัน/แยกกันอยู่" }
]

export const _Q08= [
    { value: "0", text: "ไม่ได้ศึกษา/ไม่มีวุฒิการศึกษา" },
    { value: "1", text: "ก่อนประถมศึกษา" },
    { value: "2", text: "ประถมศึกษา" },
    { value: "3", text: "มัธยมศึกษาตอนต้น" },
    { value: "4", text: "มัธยมศึกษาตอนปลาย (รวม ปวช.)" },
    { value: "5", text: "สูงกว่ามัธยมศึกษาตอนปลาย (อนุปริญญา)" },
    { value: "6", text: "ปริญญาตรี" },
    { value: "7", text: "ปริญญาโท" },
    { value: "8", text: "ปริญญาเอก" },
    { value: "9", text: "การศึกษาอื่น ๆ" }
]

export const _Q22= [
    { value: "1", text: "ประกอบอาชีพเกษตร" },
    { value: "2", text: "รับเงินเดือนประจำ" },
    { value: "3", text: "รับจ้างทำการเกษตร" },
    { value: "4", text: "ประกอบธุรกิจการค้า" },
    { value: "5", text: "รับจ้างทั่วไป" },
    { value: "6", text: "ทำงานอื่นๆ" },
    { value: "7", text: "ไม่ทำงานเชิงเศรษฐกิจ/ว่างงาน" }
]

export const _Q23= [
    { value: "1", text: "ประกอบอาชีพเกษตร" },
    { value: "2", text: "รับเงินเดือนประจำ" },
    { value: "3", text: "รับจ้างทำการเกษตร" },
    { value: "4", text: "ประกอบธุรกิจการค้า" },
    { value: "5", text: "รับจ้างทั่วไป" },
    { value: "6", text: "ทำงานอื่นๆ" },
    { value: "7", text: "ไม่มีอาชีพรอง" }
]

export const _R01_1= [
    { value: "1", text: "น้อย" },
    { value: "2", text: "ปานกลาง" },
    { value: "3", text: "มาก" }
]

export const _R01_2= [
    { value: "1", text: "ไม่ได้รับ" },
    { value: "0", text: "ได้รับ" }
]

export const _Triangulation= [
    { value: "1", text: "ข้อมูลถูกต้อง" },
    { value: "0", text: "ข้อมูลไม่ถูกต้อง" }
]




